In [21]:
import pandas as pd

In [22]:
import numpy as np

In [23]:
import sys

In [24]:
#creating Datafram

In [25]:
user_1 = pd.DataFrame([[1,'YASH',18,'BSC'],[2,'ROHIT',20,'BSC'],[3,'DINKAR',21,'BSC']])

In [26]:
cols = ['ROLL_NO','NAME','AGE','DEGREE']

In [27]:
user_2 =  pd.DataFrame([[1,'YASH',18,'BSC'],[2,'ROHIT',20,'BSC'],[3,'DINKAR',21,'BSC']],columns = cols)

In [28]:
user_2

   ROLL_NO    NAME  AGE DEGREE
0        1    YASH   18    BSC
1        2   ROHIT   20    BSC
2        3  DINKAR   21    BSC

In [29]:
#Creating dataframe using dictionary

In [30]:
user_3 = pd.DataFrame(dict(Roll_Number = [1,2,3],Name = ['Yash','Rohit','Preyanshu'],Age = [18,20,19]))

In [31]:
user_3

   Roll_Number       Name  Age
0            1       Yash   18
1            2      Rohit   20
2            3  Preyanshu   19

In [32]:
#Creating Series

In [33]:
x = [1,2,3,4,5,6]

In [34]:
s=pd.Series(x)

In [35]:
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [36]:
Index = ['A','B','C','D','E','F']

In [37]:
s1 = pd.Series(data =x , index = Index)

In [38]:
    s1

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [39]:
#Creating DF from dict

In [40]:
Countries = ['Aus', 'Ind' ,'Jap','Chi','Rus',]

In [41]:
Visa = ['A','I','J','C','R']

In [42]:
Power = ['P','PM','P','P','PM']

In [43]:
dictionary = {'Countries' : Countries , 'Visa' : Visa , 'Power' : Power}

In [44]:
my_dict = pd.DataFrame(dictionary)

In [45]:
my_dict

  Countries Visa Power
0       Aus    A     P
1       Ind    I    PM
2       Jap    J     P
3       Chi    C     P
4       Rus    R    PM

In [46]:
my_dict.index

RangeIndex(start=0, stop=5, step=1)

In [47]:
row_labels = ['a','b','c','d','e']

In [48]:
my_dict.index = row_labels

In [49]:
my_dict

  Countries Visa Power
a       Aus    A     P
b       Ind    I    PM
c       Jap    J     P
d       Chi    C     P
e       Rus    R    PM

In [50]:
#CONCATING TWO DF

In [51]:
cols = ['Name','AGE','SEX']

In [52]:
DF1 = pd.DataFrame([['Yash','18','m'],['rohit','18','m'],['vijay','18','fm']],columns = cols )

In [53]:
DF2 = pd.DataFrame(dict(Name = ['dINKAR','PREYANSHU'],AGE = [18,19],SEX = ['M','F']))

In [54]:
DF_FINAL = pd.concat((DF1,DF2))

In [55]:
DF_FINAL

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [56]:
#Suppose i want to add one more column which is Salary , we will use "MERGE" function

In [57]:
df_sal = pd.DataFrame(dict(Name = ['Yash','vijay'],Sal = [2000,300]))

In [58]:
inner = pd.merge(DF_FINAL,df_sal,how='inner',on='Name')

In [59]:
inner

    Name AGE SEX   Sal
0   Yash  18   m  2000
1  vijay  18  fm   300

In [60]:
outer = pd.merge(DF_FINAL,df_sal,how='outer',on='Name')

In [61]:
outer

        Name AGE SEX     Sal
0       Yash  18   m  2000.0
1      rohit  18   m     NaN
2      vijay  18  fm   300.0
3     dINKAR  18   M     NaN
4  PREYANSHU  19   F     NaN

In [62]:
#RESHAPPING DATAFRAME by melt function

In [63]:
stack = pd.melt(DF_FINAL, id_vars = 'Name',var_name ='variable',value_name ='value')

In [64]:
stack

        Name variable value
0       Yash      AGE    18
1      rohit      AGE    18
2      vijay      AGE    18
3     dINKAR      AGE    18
4  PREYANSHU      AGE    19
5       Yash      SEX     m
6      rohit      SEX     m
7      vijay      SEX    fm
8     dINKAR      SEX     M
9  PREYANSHU      SEX     F

In [65]:
#again converting it back

In [66]:
print(stack.pivot(index = 'Name',columns='variable',values = 'value'))

variable  AGE SEX
Name
PREYANSHU  19   F
Yash       18   m
dINKAR     18   M
rohit      18   m
vijay      18  fm

In [67]:
#SUMMARIZING

In [68]:
#TYPE OF DF

In [69]:
type(DF_FINAL)

pandas.core.frame.DataFrame

In [70]:
#PRINT TOP 5 ROWS

In [71]:
DF_FINAL.head()

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [72]:
#PRINT BOTTOM 5 ROWS

In [73]:
DF_FINAL.tail()

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [74]:
#index numbers

In [75]:
DF_FINAL.index

Index([0, 1, 2, 0, 1], dtype='int64')

In [76]:
#column headers

In [77]:
DF_FINAL.columns

Index(['Name', 'AGE', 'SEX'], dtype='object')

In [78]:
#Data type of each columns

In [79]:
DF_FINAL.dtypes

Name    object
AGE     object
SEX     object
dtype: object

In [80]:
#shape

In [81]:
DF_FINAL.shape

(5, 3)

In [82]:
#values

In [83]:
DF_FINAL.values

array([['Yash', '18', 'm'],
       ['rohit', '18', 'm'],
       ['vijay', '18', 'fm'],
       ['dINKAR', 18, 'M'],
       ['PREYANSHU', 19, 'F']], dtype=object)

In [84]:
#get information About DF

In [85]:
DF_FINAL.info

<bound method DataFrame.info of         Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F>

In [86]:
#column selection

In [87]:
DF_FINAL['Name']

0         Yash
1        rohit
2        vijay
0       dINKAR
1    PREYANSHU
Name: Name, dtype: object

In [88]:
type(DF_FINAL['Name'])

pandas.core.series.Series

In [89]:
DF_FINAL[['Name','AGE']]

        Name AGE
0       Yash  18
1      rohit  18
2      vijay  18
0     dINKAR  18
1  PREYANSHU  19

In [90]:
df = DF_FINAL.copy()

In [91]:
#ROW SELECTION BY FUNCTIONS :- iloc , loc, ix , loc and ix are not highly used

In [92]:
#1st row print

In [93]:
df.iloc[0]

Name    Yash
AGE       18
SEX        m
Name: 0, dtype: object

In [94]:
#1st index to 3rd index exluiding 3rd row

In [95]:
df.iloc[0:3]

    Name AGE SEX
0   Yash  18   m
1  rohit  18   m
2  vijay  18  fm

In [96]:
#1st row 1st element

In [97]:
df.iloc[0,0]

'Yash'

In [98]:
#updating element

In [99]:
df.iloc[0,1]=30

In [100]:
df

        Name AGE SEX
0       Yash  30   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [101]:
#Row selection with certain conditions

In [102]:
#DF_FINAL[DF_FINAL.AGE<30]

In [103]:
#young = DF_FINAL.AGE<30

In [104]:
DF_FINAL

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [ ]:
DF_FINAL[DF_FINAL.AGE<35].SEX   #IT WILL GIVE THE SEX OF THOSE PEOPLE WHOSE AGE IS LESS THAN 35

In [106]:
#ADVANCED LOGICAL FILTERING

In [ ]:
DF_FINAL[DF_FINAL.AGE<35][['SEX','NAME']]   #IT WILL GIVE THE SEX AND NAME OF THOSE PEOPLE WHOSE AGE IS LESS THAN 35

In [ ]:
DF_FINAL[(DF_FINAL.AGE<35) & (DF_FINAL.SEX == m)]   #IT WILL GIVE THE ROW WHERE AGE IS LESS THAN 35 AND SEX IS EQUAL TO 'm'

In [ ]:
DF_FINAL[DF_FINAL.SEX.isin(['M','m'])]   #IT WILL GIVE THE OCCUPATION WHERE SEX IS EQUAL TO 'M' and 'm'

In [107]:
#SORTING

In [ ]:
df.sort_values(by = ["AGE"]) #IT WILL SORT THE DATAFRAME IN ASCENDING ORDER BY AGE

In [ ]:
df.sort_values(by = ["AGE"],ascending = False) #IT WILL SORT THE DATAFRAME IN DESCENDING ORDER BY AGE

In [108]:
#Sort by multiple rows and columns

In [ ]:
df.sort_values(by = ["AGE","SEX"]) #IT WILL SORT THE DATAFRAME IN ASCENDING ORDER BY AGE AND SEX

In [109]:
#MODIFY DATAFRAMES

In [ ]:
df.sort_values(by = ["AGE","SEX"] , inplace =True)

In [110]:
#DESCRYPTIVE STATISTICS

In [111]:
#describe function is used for numerical statistics

In [112]:
print(df)

        Name AGE SEX
0       Yash  30   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [ ]:
#df.describe() THIS WILL GIVE THE STATISTICS OF NUMERICAL COLUMNS

In [ ]:
#df.describe(include = 'all') THIS WILL GIVE THE STATISTICS OF ALL COLUMNS

In [ ]:
#df.describe(include = 'objects') THIS WILL GIVE THE STATISTICS OF CATEGORICAL COLUMNS

In [ ]:
#df.groupby("SEX").mean()  THIS WILL GIVE THE MEAN OF AGES FOR THE VALUES EQUAL TO OF SEX.....THIS IS WE CALLED AS STATISTICS BY GROUP

In [125]:
#DEALING WITH DUPLICATE VALUES

In [129]:
DF_FINAL

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [130]:
DF2

        Name  AGE SEX
0     dINKAR   18   M
1  PREYANSHU   19   F

In [132]:
DFF = pd.concat((DF_FINAL,DF2))

In [133]:
DFF

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F
0     dINKAR  18   M
1  PREYANSHU  19   F

In [ ]:
#CHECKING DUPLICATES BY BOOLEANS

In [134]:
DFF.duplicated()

0    False
1    False
2    False
0    False
1    False
0     True
1     True
dtype: bool

In [ ]:
#Count number of Duplicates

In [135]:
DFF.duplicated().sum()

2

In [ ]:
#Show Duplicates

In [136]:
DFF[DFF.duplicated()]

        Name AGE SEX
0     dINKAR  18   M
1  PREYANSHU  19   F

In [137]:
#CHECK COLUMN FOR DUPLICATES

In [138]:
DFF.AGE.duplicated()

0    False
1     True
2     True
0    False
1    False
0     True
1     True
Name: AGE, dtype: bool

In [ ]:
#DROPPING DUPLICATE VALUES

In [139]:
DFF_D = DFF.drop_duplicates()

In [140]:
DFF_D

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F

In [141]:
DFF

        Name AGE SEX
0       Yash  18   m
1      rohit  18   m
2      vijay  18  fm
0     dINKAR  18   M
1  PREYANSHU  19   F
0     dINKAR  18   M
1  PREYANSHU  19   F

In [ ]:
################################################################################################################################

In [ ]:
#IMPORTING DATAFRAMES

In [ ]:
# income = pd.read_csv('file name')

In [ ]:
#changing datatypes

In [ ]:
#income.Y2015 = income.Y2015.astype(float)

In [ ]:
#getting no of rows in dataframes

In [ ]:
#income.shape[0]

In [ ]:
#getting no of columns in dataframes

In [ ]:
#income.shape[1]

In [ ]:
#Extract unique values

In [ ]:
#income.index.unique()

In [ ]:
#count number of unique values

In [ ]:
#income.index.nunique()

In [ ]:
#Generating crosstabs

In [ ]:
#pd.crosstab(income.Index , income.State)-----This will tell one value has occured in which rows

In [ ]:
#Creating Freq Distributions

In [ ]:
#income.Index.value_counts(ascending = True)

In [ ]:
#DRAW SAMPLE OF DATA ----> This will give you random rows

In [ ]:
#income.sample(n=6) ----> This will give 6 you random rows

In [ ]:
#select few columns

In [ ]:
#df = income.loc[:,['INDEX','STATE]']

In [ ]:
#select CONSECUTIVE columns

In [ ]:
#df = income.loc[:,'INDEX':'STATE']

In [ ]:
#df.iloc[:,0:5]

In [ ]:
#RENAME ALL VARIABLES

In [ ]:
#df.columns = ['state', 'name','roll no'] ----> This will be the new column

In [ ]:
#RENAME some VARIABLES

In [ ]:
#df.rename(columns ={'state':'rajya'},inplace = True)

In [ ]:
#income in which variable contains Y as Year

In [ ]:
#income.columns = income.columns.str.replace('y','year')

In [ ]:
#Removing Rows and Colums: income.drop("Index",axis=1)

In [ ]:
#Drop more variables : income.drop(["Index","State"],axis=1)

In [ ]:
#Drop Rows --------->income.drop(0,axis=0)

In [ ]:
#CHECKING MISSING VALUES ------> crops.isnull()

In [ ]:
#Count no of missing values ------> crops.isnull().sum()

In [ ]:
#Replacing NaN with any other variable---> crops.cost.fillna(value='unknown',inplace=True)